[
	{
		"slug": "ti-brand-primary",
		"value": "#A1B2C3",
		"description": "Primary brand color. Can be used for buttons, links, and sometimes as background. Any text over this should apply the px-on-brand color."
	},
	{
		"slug": "ti-brand-secondary",
		"value": "#D4E5F6",
		"description": "Secondary brand color. Can be used for accents, and sometimes as background."
	},
	{
		"slug": "ti-bg-body",
		"value": "#F8F8F8",
		"description": "The main body color of the website. Usually white or almost white."
	},
	{
		"slug": "ti-bg-light",
		"value": "#EAEAEA",
		"description": "A subtle variation of the body background, that is used to visually separate sections and areas of the layout."
	},
	{
		"slug": "ti-bg-lighter",
		"value": "#DDDDDD",
		"description": "A lighter tint of the light background."
	},
	{
		"slug": "ti-bg-dark",
		"value": "#333333",
		"description": "Areas of the website that have a dark background, and require tet to be inverted in order to be readable. For example, text over a black background needs to be white."
	},
	{
		"slug": "ti-bg-darker",
		"value": "#111111",
		"description": "A darker tint of the dark background."
	},
	{
		"slug": "ti-type-body",
		"value": "#222222",
		"description": "The main color of the body text. It is applied on text that is over the body background, or any of the light variants."
	},
	{
		"slug": "ti-type-titles",
		"value": "#444444",
		"description": "The color of headings. Usually the titles are the same color as the body text. ut if the user wants to have a dedicated color, we can provide that. This can be an existing brand color or complementary. It would be great if this color could work for headinngs over dark backgrounds, but it is not a requirement."
	},
	{
		"slug": "ti-type-secondary",
		"value": "#888888",
		"description": "This is some visually downplayed text color. Think of it like gray text. For efficiency, this can be an opacity of the body color. Must be readable over body and light backgrounds."
	},
	{
		"slug": "ti-type-on-dark",
		"value": "#FFFFFF",
		"description": "This color is applied on text that is over a dark background. For example, if the background color is black, the text color is white."
	},
	{
		"slug": "ti-type-on-brand",
		"value": "#FFFFFF",
		"description": "For any text that is over the brand color, we apply this color. This color should provide sufficient contrast."
	}
]